///////////////////////////////////////////1.////////////////////////////// Дана переменная a со значением '10' и переменная b со значением '20'. Сложите данные переменные как числа.

/*let a = "10";
let b = "20";

let result = +a + +b;
console.log(result);*/

///////////////////////////////////////////2./////////////////////////////////
/* Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран..*/

/*let a = 20;
let b = 22;

let myString = String(a) + String(b);
console.log(myString);*/

///////////////////////////////////////////3.///////////////////////////////
/*Переделайте этот код так, чтобы в нем применялись операции инкремента и декремента:*/

/*let num = 10;
num++;
num++;
num--;
console.log(num);*/

///////////////////////////////////////////4.///////////////////////////////
//Напишите скрипт, который вычисляет количество секунд в году.
// Список единиц измерения
let measures = [
  { text: "second", value: 1 },
  { text: "minute", value: 60 },
  { text: "hour", value: 3600 },
  { text: "day", value: 86400 },
  { text: "year", value: 31536000 },
];

console.log(`В году - ${measures[4].value} секунд`);
