//# Задание 4

**Напишите скрипты для решения следующих задач:**

1. Дана переменная `a` со значением `'10'` и переменная `b` со значением `'20'`. Сложите данные переменные как числа.
2. Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран..
3. Переделайте этот код так, чтобы в нем применялись операции инкремента и декремента:

    ```jsx
    let num = 10;
    num = num + 1;
    num = num + 1;
    num = num - 1;
    alert(num);
    ```

4. Напишите скрипт, который вычисляет количество секунд в году.