//# Задание 5
////////////////////////////////////// 1 ////////////////////////////////////
//1 Сделайте функцию, которая параметром принимает число и выводит в консоль куб этого числа.

////////////////////////////////////// 2 ////////////////////////////////////
//2. Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное. В первом случае пусть функция выводит в консоль текст '+++', а во втором '---'

////////////////////////////////////// 3 ////////////////////////////////////
//3. Сделайте функцию, которая параметром принимает число, а возвращает куб этого числа. С помощью этой функции найдите куб числа `3`  и запишите его в переменную `res`

4. Сделайте функцию, которая будет принимать число, а возвращать это число прописью. Пусть функция работает с числами до `999`. Смотрите пример:

    `func(123); // выведет 'сто двадцать три'`# Задание 5

**Напишите скрипты для решения следующих задач:**

1. Сделайте функцию, которая параметром принимает число и выводит в консоль куб этого числа.
2. Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное. В первом случае пусть функция выводит в консоль текст `'+++'`
, а во втором `'---'`
3. Сделайте функцию, которая параметром принимает число, а возвращает куб этого числа. С помощью этой функции найдите куб числа `3`  и запишите его в переменную `res`

4. Сделайте функцию, которая будет принимать число, а возвращать это число прописью. Пусть функция работает с числами до `999`. Смотрите пример:

    `func(123); // выведет 'сто двадцать три'`